In [1]:
import pandas as pd
import xlrd
import numpy as np

In [2]:
df = pd.read_excel("Canada.xlsx")
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [3]:
df_new = df[['AreaName', 1980, 1981]]
df_new = df_new.head(5)

In [4]:
df_new

  AreaName  1980  1981
0     Asia    16    39
1   Europe     1     0
2   Africa    80    67
3  Oceania     0     1
4   Europe     0     0

#### Creating few NULL values

In [5]:
df_new.loc[4,"AreaName"] = np.nan
df_new.loc[3,1980] = np.nan
df_new.loc[1,1980] = np.nan
df_new.loc[2,1981] = np.nan
df_new.loc[4,1981] = np.nan

In [6]:
df_new

  AreaName  1980  1981
0     Asia  16.0  39.0
1   Europe   NaN   0.0
2   Africa  80.0   NaN
3  Oceania   NaN   1.0
4      NaN   0.0   NaN

# isnull()  --- Ideally need to apply on Column

#### It check every value. Return True if value is NULL, False otherwise

#### It should be run on Column to check if column Contains NULL values. As different column generally contains diffrenet datatype values. First check what type of data column contains, then fill data over NULL values accordingly

In [7]:
df_new[1980].isnull()

0    False
1     True
2    False
3     True
4    False
Name: 1980, dtype: bool

In [8]:
df_new[df_new[1980].isnull()]

  AreaName  1980  1981
1   Europe   NaN   0.0
3  Oceania   NaN   1.0

In [9]:
df_new[~ df_new[1980].isnull()]

  AreaName  1980  1981
0     Asia  16.0  39.0
2   Africa  80.0   NaN
4      NaN   0.0   NaN

#### first check Column Type

In [10]:
str(df_new[1980].dtype)

'float64'

#### Based on type of the column fill Values over NULL value

In [11]:
df_new

  AreaName  1980  1981
0     Asia  16.0  39.0
1   Europe   NaN   0.0
2   Africa  80.0   NaN
3  Oceania   NaN   1.0
4      NaN   0.0   NaN

In [12]:
if True in df_new[1980].isnull():
    if str(df_new[1980].dtype) == 'float64':
        df_new[1980].fillna(df_new[1980].mean(), inplace=True)  # (16+80)/3

In [13]:
df_new

  AreaName  1980  1981
0     Asia  16.0  39.0
1   Europe  32.0   0.0
2   Africa  80.0   NaN
3  Oceania  32.0   1.0
4      NaN   0.0   NaN

# isnull() --- On DataFrame

In [14]:
df_new

  AreaName  1980  1981
0     Asia  16.0  39.0
1   Europe  32.0   0.0
2   Africa  80.0   NaN
3  Oceania  32.0   1.0
4      NaN   0.0   NaN

In [15]:
df_new.isnull()

   AreaName   1980   1981
0     False  False  False
1     False  False  False
2     False  False   True
3     False  False  False
4      True  False   True